<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="onnx::MatMul_0" type="Parameter" version="opset1">
			<data shape="40" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::MatMul_0">
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="layer2.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" names="layer2.bias">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="layer2.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="layer1.bias_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128" offset="2" size="256" />
			<output>
				<port id="0" precision="FP16" names="layer1.bias">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="layer1.bias" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Transpose_1120_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 40" offset="258" size="10240" />
			<output>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Transpose_1120" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/layer1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer1/MatMul_output_0">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/layer1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer1/Add_output_0">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/Relu_output_0">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Transpose_1123_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="10498" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Transpose_1123" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/layer2/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer2/MatMul_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/layer2/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/layer2/Add_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="12" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="12">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="12/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="7" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="13" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="8" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="1" to-layer="7" to-port="1" />
		<edge from-layer="7" from-port="2" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="13" to-port="1" />
		<edge from-layer="13" from-port="2" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2023.3.0-13775-ceeafaf64f3-releases/2023/3" />
		<conversion_parameters>
			<is_python_object value="False" />
		</conversion_parameters>
	</rt_info>
</net>
